Res-perfCacheNStatA-social1-v2/Res-firecracker-random-v1/firecracker_t_10_c_30_composePosts_composeVcpu_4_wrkVcpu_1_R_200/wrk.txt
Running 1m test @ http://nginx-thrift:8080/wrk2-api/post/compose
  10 threads and 30 connections
  Thread calibration: mean lat.: 7.844ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 7.838ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 7.845ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 7.697ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 7.877ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 8.262ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 7.604ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 7.946ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 7.962ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 7.801ms, rate sampling interval: 19ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     7.59ms    1.99ms  15.24ms   80.16%
    Req/Sec    20.22     32.70   111.00     88.64%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.29ms
 75.000%    8.34ms
 90.000%    9.69ms
 99.000%   15.24ms
 99.900%   21.01ms
 99.990%   25.01ms
 99.999%   29.41ms
100.000%   29.41ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.465     0.000000            1         1.00
       5.655     0.100000          992         1.11
       6.155     0.200000         1985         1.25
       6.543     0.300000         2975         1.43
       6.903     0.400000         3976         1.67
       7.287     0.500000         4966         2.00
       7.467     0.550000         5462         2.22
       7.667     0.600000         5951         2.50
       7.863     0.650000         6451         2.86
       8.091     0.700000         6941         3.33
       8.343     0.750000         7437         4.00
       8.511     0.775000         7691         4.44
       8.663     0.800000         7933         5.00
       8.839     0.825000         8182         5.71
       9.063     0.850000         8430         6.67
       9.327     0.875000         8675         8.00
       9.487     0.887500         8801         8.89
       9.687     0.900000         8927        10.00
       9.855     0.912500         9046        11.43
      10.103     0.925000         9169        13.33
      10.423     0.937500         9294        16.00
      10.639     0.943750         9356        17.78
      10.967     0.950000         9417        20.00
      11.303     0.956250         9479        22.86
      11.663     0.962500         9541        26.67
      12.199     0.968750         9604        32.00
      12.527     0.971875         9635        35.56
      12.807     0.975000         9665        40.00
      13.199     0.978125         9696        45.71
      13.623     0.981250         9728        53.33
      14.159     0.984375         9758        64.00
      14.463     0.985938         9773        71.11
      14.791     0.987500         9789        80.00
      15.031     0.989062         9804        91.43
      15.551     0.990625         9820       106.67
      15.975     0.992188         9835       128.00
      16.319     0.992969         9844       142.22
      16.559     0.993750         9851       160.00
      16.879     0.994531         9858       182.86
      17.263     0.995313         9867       213.33
      17.855     0.996094         9874       256.00
      18.127     0.996484         9878       284.44
      18.383     0.996875         9882       320.00
      18.543     0.997266         9885       365.71
      18.927     0.997656         9889       426.67
      19.535     0.998047         9893       512.00
      19.695     0.998242         9895       568.89
      19.951     0.998437         9897       640.00
      20.239     0.998633         9899       731.43
      20.623     0.998828         9901       853.33
      21.103     0.999023         9903      1024.00
      21.231     0.999121         9904      1137.78
      21.295     0.999219         9905      1280.00
      21.519     0.999316         9906      1462.86
      22.031     0.999414         9907      1706.67
      22.559     0.999512         9908      2048.00
      22.559     0.999561         9908      2275.56
      24.335     0.999609         9909      2560.00
      24.335     0.999658         9909      2925.71
      24.559     0.999707         9910      3413.33
      24.559     0.999756         9910      4096.00
      24.559     0.999780         9910      4551.11
      25.007     0.999805         9911      5120.00
      25.007     0.999829         9911      5851.43
      25.007     0.999854         9911      6826.67
      25.007     0.999878         9911      8192.00
      25.007     0.999890         9911      9102.22
      29.407     0.999902         9912     10240.00
      29.407     1.000000         9912          inf
#[Mean    =        7.591, StdDeviation   =        1.988]
#[Max     =       29.392, Total count    =         9912]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  11912 requests in 1.00m, 2.44MB read
Requests/sec:    198.49
Transfer/sec:     41.68KB